"espk" = "Apple 스피커 포트";
"ispk" = "내장";
"emic" = "마이크 포트";
"imic" = "내장";
"hdpn" = "헤드폰 포트";
"lini" = "오디오 라인 입력 포트";
"lino" = "오디오 라인 출력 포트";
"spdi" = "광학 디지털 입력 포트";
"spdo" = "광학 디지털 출력 포트";
"pci " = "PCI 카드";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "네트워크 기기";
"blue" = "Bluetooth";
"bluh" = "Bluetooth 헤드폰";
"blus" = "Bluetooth 헤드셋";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
